namespace Nutshell.Theory
{
    public class OOP
    {
        //Object orientation paradigm: encapsulation, inheritance, abstraction and polymorphism
        
        //Инкапсуляция – это свойство системы, позволяющее объединить данные и методы, работающие с ними,
        //в классе и скрыть детали реализации от пользователя, открыв только то, что необходимо при последующем использовании.
        
        //Наследование – это свойство системы, позволяющее описать новый класс на основе уже существующего с частично или полностью заимствующейся функциональностью.
        
        //Полиморфизм – это свойство системы использовать объекты с одинаковым интерфейсом без информации о типе и внутренней структуре объекта.
        
        //Абстрагирование – это способ выделить набор общих характеристик объекта, исключая из рассмотрения частные и незначимые.
        //Соответственно, абстракция – это набор всех таких характеристик.
    }
}